[
  {
    "name": "350 - SFU",
    "description": "To raise awareness among students, faculty, and alumni about SFU's role in mitigating climate change.",
    "logo": "https://go.sfss.ca/clubs/390/logo"
  },
  {
    "name": "Accounting Student Association - SFU",
    "description": "The SFU Accounting Student Association (ASA) is an organization made up of highly-dedicated students with the mission of assisting student towards their professional life. In order to accomplish this mission, our association provides three types of services: facilitation of information and networking, self-growth, and fellowship.",
    "logo": "https://go.sfss.ca/clubs/123/logo"
  },
  {
    "name": "Ace SFU",
    "description": "Ace SFU’s mandate is to create a business club environment in which students can participate in business themed case competitions at various locations throughout Canada. Ace SFU would be directly affiliated with Ace Canada, a world-renowned case competition organization.",
    "logo": "https://go.sfss.ca/clubs/858/logo"
  },
  {
    "name": "Afghanistan Student Union",
    "description": "Afghanistan Student Union promotes Afghan culture and builds a community for Afghan students across SFU campuses. Our goal is to create a supportive space for students to share experiences and celebrate their heritage. We also welcome those interested in Afghanistan’s traditions to join our club and participate in our events.",
    "logo": "https://go.sfss.ca/clubs/937/logo"
  },
  {
    "name": "AIESEC",
    "description": "The world's largest youth-run non-profit organization, developing leadership in young people through global cross-cultural volunteer and internship exchanges.",
    "logo": "https://go.sfss.ca/clubs/101/logo"
  },
  {
    "name": "ALAS (Association of Latin American Students)",
    "description": "Provide a space of entertainment and learning for Latin American students and those who love the Latino culture. We want to promote a space that cherish our multicultural community, while fostering an environment of respect and growth.",
    "logo": "https://go.sfss.ca/clubs/169/logo"
  },
  {
    "name": "Amnesty International SFU",
    "description": "To show our dedication to the promotion and protection of human rights.",
    "logo": "https://go.sfss.ca/clubs/127/logo"
  },
  {
    "name": "Anime Club - SFU",
    "description": "To bring together like-minded students who wish to share their appreciation for anime and manga, and related interests/hobbies.",
    "logo": "https://go.sfss.ca/clubs/356/logo"
  },
  {
    "name": "Arab Students' Association",
    "description": "The Arab Students' Association is here to celebrate the diverse cultures and experiences that unite under a collective Arab identity. The ASA aims at bringing together SFU's Arab students and all those who identify or connect with an Arab society. By holding a variety of cultural events, we also invite the broader community to engage with us.",
    "logo": "https://go.sfss.ca/clubs/776/logo"
  },
  {
    "name": "Ascend Leadership",
    "description": "As the 2nd University Chapter of Ascend in Western Canada, Ascend SFU’s primary vision is to enhance the presence, influence, and visibility of current and future Pan-Asian leadership in our community through professional networking, mentorship, and internship opportunities.",
    "logo": "https://go.sfss.ca/clubs/743/logo"
  },
  {
    "name": "Astronomy Club - SFU",
    "description": "To promote and practice amateur astronomy and facilitate related activities at SFU and in the greater community. We welcome anyone interested in exploring our universe, our earth, or any space-related topics. Please view our website for links to join the community!",
    "logo": "https://go.sfss.ca/clubs/63/logo"
  },
  {
    "name": "Backpacking Club",
    "description": "To bring together a community of experienced hikers to tackle difficult and ambitious hikes, including those lasting for 2 or more days. Our focus is on providing the additional support, supplies, and planning required for these challenging but rewarding adventures.",
    "logo": "https://go.sfss.ca/clubs/802/logo"
  },
  {
    "name": "Bangladesh Students' Alliance",
    "description": "Promote the heritage of Bangladesh at SFU. Provide assistance to both new and existing students from Bangladesh. Organize social & cultural events to create a multicultural acquaintanceship within the SFU community.",
    "logo": "https://go.sfss.ca/clubs/485/logo"
  },
  {
    "name": "Bhangra - SFU",
    "description": "To spread and promote health and well being as well as provide students with an avenue to connect with their artistic side as well as getting a great cardiovascular workout through the wonderful dance of Bhangra. Great for people of all cultures, backgrounds and dance levels.",
    "logo": "https://go.sfss.ca/clubs/544/logo"
  },
  {
    "name": "BRASA SFU",
    "description": "BRASA SFU (Brazilian Students Association) is for any student interested in Brazilian culture. We celebrate Brazil's art, festivities, and Portuguese language while fostering a sense of community. The club also emphasizes professional development through networking events, conferences, and partnerships with the BRASA Global network.",
    "logo": "https://go.sfss.ca/clubs/933/logo"
  },
  {
    "name": "Burnaby Mountain Toastmasters",
    "description": "This club aims at improving members' public speaking skills and expanding their social network.",
    "logo": "https://go.sfss.ca/clubs/60/logo"
  },
  {
    "name": "Campus Association of Baha'i Studies",
    "description": "A space created to discuss and share thoughts about various spiritual teachings and learn about engaging in the prevalent discourses of society. CABS seeks to provide a forum for students of all races, colours, classes, nationalities and religions to discuss the urgent issues facing society today.",
    "logo": "https://go.sfss.ca/clubs/420/logo"
  },
  {
    "name": "Campus Vibe for Christ",
    "description": "We are the light of the world and carriers of God’s presence, with a mandate. Awaken our campus to the love and purpose of Christ. Equip one another for a life of kingdom impact and deploy for multiplication as each one builds into another.",
    "logo": "https://go.sfss.ca/clubs/641/logo"
  },
  {
    "name": "Canadian Cancer Society - SFU",
    "description": "Through a small group of motivated and passionate students, we help raise awareness of different types of cancers through awareness themed months. We also organize and host one of SFU’s biggest cancer related fundraisers, Relay for Life! Through these efforts, all proceeds are given directly to the Canadian Cancer Society.",
    "logo": "https://go.sfss.ca/clubs/619/logo"
  },
  {
    "name": "Canadian Liver Foundation SFU",
    "description": "We strive towards promoting liver disease awareness by providing education to the community. The CLF SFU Club actively engages in fundraising, volunteering and health promotion activities to support a worthwhile cause, by gathering donations for the CLF to fund liver disease research and patient treatment necessities.",
    "logo": "https://go.sfss.ca/clubs/876/logo"
  },
  {
    "name": "Canadianized Asian Club (CAC)",
    "description": "Our goal as a student-led non-profit organization is to enhance student’s university experience, placing our membership body first. We strive to build an inclusive community that engages students through a variety of activities and events. We encourage students to join our executive committee to further their experience.",
    "logo": "https://go.sfss.ca/clubs/44/logo",
    "email": "talktocac@gmail.com",
    "website": "https://caconline.ca"
  },
  {
    "name": "CaseIT",
    "description": "CaseIT is team of likeminded individuals who organize and host an annual international business case competition with a strong Management Information Systems focus. CaseIT has strived to bridge technology and business by providing a platform for exceptional students from around the world to showcase their skills in case analysis and IT strategy.",
    "logo": "https://go.sfss.ca/clubs/533/logo"
  },
  {
    "name": "Chess Club - SFU",
    "description": "The SFU Chess club provides the means of social activity, mutual helpfulness,recreation, and mental improvement.",
    "logo": "https://go.sfss.ca/clubs/513/logo"
  },
  {
    "name": "Chinese Students and Scholars Association",
    "description": "The Chinese Students and Scholars Association is dedicated to building an inclusive, connected community for everyone with or without a Chinese background. We aim to enrich all members’ non-academic lives by hosting diverse, accessible events, such as performances, cultural sharing sessions, and social gatherings that celebrate global perspectives.",
    "logo": "https://go.sfss.ca/clubs/126/logo"
  },
  {
    "name": "Choir - SFU",
    "description": "To have fun and make awesome music! No experience necessary.",
    "logo": "https://go.sfss.ca/clubs/151/logo"
  },
  {
    "name": "Christian Leadership Initiative - SFU",
    "description": "SFU CLI runs the God & Reason Lecture series:\na public lecture series of scholars and students exploring the Christian worldview by applying aspects of philosophy, reason, and scholarship to discuss faith.",
    "logo": "https://go.sfss.ca/clubs/175/logo"
  },
  {
    "name": "Christian Students @ SFU",
    "description": "\"But flee youthful lusts, and pursue righteousness, faith, love, peace with those who call on the Lord out of a pure heart.\" 2 Timothy 2:22",
    "logo": "https://go.sfss.ca/clubs/57/logo"
  },
  {
    "name": "Concert Orchestra - SFU",
    "description": "We are an ensemble of musicians that is always expanding. We love playing because it's fun, no stress! If you play any orchestral or concert instrument feel free to contact us. We are here to promote the musical community at Burnaby campus.",
    "logo": "https://go.sfss.ca/clubs/65/logo"
  },
  {
    "name": "Debate Society",
    "description": "The official debating team for SFU and a member of the Canadian University Society for Intercollegiate Debate (CUSID). We are a group of passionate individuals dedicated to fostering an inclusive atmosphere, where everyone feels safe expressing their views. We hope to teach SFU Students how to debate, critically think and publicly speak well.",
    "logo": "https://go.sfss.ca/clubs/193/logo"
  },
  {
    "name": "Developers & Systems Club",
    "description": "Get together and work on cool collaborative programming projects with fellow members!",
    "logo": "https://go.sfss.ca/clubs/912/logo"
  },
  {
    "name": "Dodo Club",
    "description": "Inspired by the elusive and extinct dodo, we believe that life is too short not to be enjoyed. As a club, we strive to provide a student support system promoting positivity and mental health. Social activities have included minigolf, arcade games, chatting on Discord, and movies with snacks.",
    "logo": "https://go.sfss.ca/clubs/864/logo"
  },
  {
    "name": "EAT!SFU",
    "description": "Our club is open to all SFU students. We want this to be an inclusive and fun space for our peers to get together with like minded individuals and share their love about food as well as nurture a safe space to battle food insecurity.",
    "logo": "https://go.sfss.ca/clubs/915/logo"
  },
  {
    "name": "Enactus SFU",
    "description": "To encourage entrepreneurship on our campuses and in the community through our various programs. We consider the relevant economic, social and environmental factors to effectively empower people in need\nby applying business and economic concepts and an entrepreneurial approach to improve their quality of life and standard of living.",
    "logo": "https://go.sfss.ca/clubs/98/logo",
    "email": "info@enactussfu.com",
    "website": "https://www.enactussfu.ca"
  },
  {
    "name": "Engineers Without Borders - SFU Chapter",
    "description": "We are a global, Canadian-based humanitarian NGO tackling systemic issues clean drinking water and energy by using technical engineers' expertise. Students from all backgrounds can join our design teams to make an impact as well as engage in political advocacy for climate change, healthcare, and economic inequality. Visit our website to learn more!",
    "logo": "https://go.sfss.ca/clubs/927/logo"
  },
  {
    "name": "Ethiopian & Eritrean Students Association",
    "description": "EESA aims to foster unity and support among Ethiopian and Eritrean students at Simon Fraser University.",
    "logo": "https://go.sfss.ca/clubs/928/logo"
  },
  {
    "name": "Exercise is Medicine SFU",
    "description": "To foster collaborative inter-professional relationships and leadership skills on campus between exercise,\nhealth and other disciplines that support the EIMC vision and goals.",
    "logo": "https://go.sfss.ca/clubs/610/logo"
  },
  {
    "name": "Filipino Students Association",
    "description": "To promote the Filipino culture and traditions within the university",
    "logo": "https://go.sfss.ca/clubs/141/logo"
  },
  {
    "name": "Finance Student Association (FINSA)",
    "description": "FINSA is a group dedicated to help finance students attending SFU. Our goals are to help SFU Finance concentrators succeed while attending SFU and after graduating from SFU and help bring the SFU Finance community together.",
    "logo": "https://go.sfss.ca/clubs/105/logo"
  },
  {
    "name": "Game Developers Club",
    "description": "We're a safe haven for game developers at SFU. Our goal is to support and teach all aspects of game development, which we accomplish by hosting periodic meetings and tutorials for sharing skills. We also provide resources to those currently working on projects.\nJoin our discord and ask us any questions! ☃︎",
    "logo": "https://go.sfss.ca/clubs/134/logo"
  },
  {
    "name": "Giddha - SFU",
    "description": "Illustrating the simplicity and beauty of the Punjabi culture through the form of traditional folk dance Gidha .\nClasses open to everyone. No dance experience required.",
    "logo": "https://go.sfss.ca/clubs/466/logo"
  },
  {
    "name": "Google Developer Student Club - SFU",
    "description": "To empower students across all majors to use modern technology to solve real-life problems in our community. Our founding principles are growth, collaboration, and innovation, and we intend to keep this principle in every networking event, competition, tech talk, and workshop we organize.",
    "logo": "https://go.sfss.ca/clubs/878/logo",
    "email": "sfu.gdsc@gmail.com",
    "website": "https://gdsc.community.dev/simon-fraser-university/"
  },
  {
    "name": "Hiking Club",
    "description": "To be up on a new mountaintop or leave footprints on a new hiking trail every chance that we get. And once we've exhausted every trail, park, terrain, peak, and forest in BC, we'll wake up one day and do it all over again.",
    "logo": "https://go.sfss.ca/clubs/622/logo"
  },
  {
    "name": "Hillel Jewish Students Association",
    "description": "We organize events at SFU based on Jewish Values, such as tikkun olam (repairing the world) and tzedakah (acts of charity). We celebrate the Jewish holidays, develop educational programs, work on social action projects, and encourage Jews of all backgrounds to connect with one another at events. IG: @sfu_jsa",
    "logo": "https://go.sfss.ca/clubs/595/logo"
  },
  {
    "name": "Hip Hop Club - SFU",
    "description": "SFU HipHop club is a club devoted to the HipHop Culture. Our main goal is to share and educate about the HipHop dance culture. We introduce styles such as popping, locking, waving, house, breaking, waacking, and much more. It is a place where you meet new people, share the same interest, learn new skills, and in general have fun.",
    "logo": "https://go.sfss.ca/clubs/286/logo"
  },
  {
    "name": "Hong Kong Society (HKS)",
    "description": "We essentially introduce Hong Kong traditions and culture, provide student-based services, encourage cultural exchange, and hold social events. Moreover, HKS aims at assisting students to adapt to the heart-warming environment in Vancouver, bonding them with close emotional attachments and building their self-confidence for future challenges.",
    "logo": "https://go.sfss.ca/clubs/710/logo"
  },
  {
    "name": "Human Resources Student Association",
    "description": "The Human Resources Student Association (HRSA) aims to serve the needs of Simon Fraser University students (business and non-business) by providing opportunities for social interaction among the student body with scholarly and professional interests from multiple disciplines within the field of Human Resource Management.",
    "logo": "https://go.sfss.ca/clubs/59/logo"
  },
  {
    "name": "Indian Student Federation (ISF)",
    "description": "Our club purpose is to speak out and unite all prospective, current and Alumni Indian students in SFU. Our vision is to organize cultural events and help Indian students build a network with one another.",
    "logo": "https://go.sfss.ca/clubs/278/logo"
  },
  {
    "name": "International Club",
    "description": "The International Club is for all students: international, UWC grads, immigrant, and Canadian. Our club is about bringing students together; building a better cross-cultural understanding; and learning more about international relations through our many activities and events. Also, the club provides an important social support network for students.",
    "logo": "https://go.sfss.ca/clubs/128/logo"
  },
  {
    "name": "Iranian Club - SFU",
    "description": "To encourage and promote Iranian culture and heritage among its members. This is achieved through organizing social activities. Iranian Club also tries to improve the link between Iranians and other cultures as we believe in both unity and diversity.",
    "logo": "https://go.sfss.ca/clubs/27/logo"
  },
  {
    "name": "Ismaili Students Association",
    "description": "A Religious Organization designed to create fun and exciting Internal and External events that engage the Post-Secondary Shia Ismaili Muslim community, and the wider SFU student body.",
    "logo": "https://go.sfss.ca/clubs/117/logo"
  },
  {
    "name": "Japanese Network - SFU",
    "description": "We are a socializing club that encourages students to learn about Japanese culture through the events we create.",
    "logo": "https://go.sfss.ca/clubs/34/logo"
  },
  {
    "name": "Jazz Band - Simon Fraser",
    "description": "The SFU Jazz Band aims to provide an opportunity for jazz musicians and enthusiasts to \trehearse and perform in a ‘BIG BAND’ setting within the SFU community.",
    "logo": "https://go.sfss.ca/clubs/212/logo"
  },
  {
    "name": "JDC West - SFU",
    "description": "JDC West is the largest student-run business competition in Western Canada that showcases academics, athletics, debate, and a social competition.The competition provides students with the opportunity to compete in all facets of business, while developing networking, critical thinking and leadership skills.",
    "logo": "https://go.sfss.ca/clubs/426/logo"
  },
  {
    "name": "Jesus Disciples Movement",
    "description": "We follow Christ’s last Great Commission. Being a Christian is about imitating Christ’s life of love, serving, and sacrificing for others. We wish to share these values to the SFU student community and train them to be Christ-like, so that they can teach others to the same and in this way it can positively impact the world. (Korean club)",
    "logo": "https://go.sfss.ca/clubs/591/logo"
  },
  {
    "name": "Korean Storm (K.STORM)",
    "description": "K.STORM is a non-profit student group that aims to promote Korean culture and media to all students from all nations. We are a social friendly community that allows members to meet new people and enjoy their university life with us.​​",
    "logo": "https://go.sfss.ca/clubs/54/logo"
  },
  {
    "name": "Kurds Students Association",
    "description": "We aim to create an inclusive space for individuals from various different background to come together and learn about the diverse aspects of the ancient Kurdish heritage. Through activities, discussions, and events, we seek to deepen understanding and appreciation for Kurdish traditions, languages, art, music, and historical narratives.",
    "logo": "https://go.sfss.ca/clubs/923/logo"
  },
  {
    "name": "Latin Dance Passion - SFU",
    "description": "The goal of Latin Dance Passion is to provide salsa and bachata dance lessons for students in a friendly environment, and at an affordable rate. We also make frequent outings to Latin dance events around Metro Vancouver to engage with the local Latin dance community.",
    "logo": "https://go.sfss.ca/clubs/125/logo"
  },
  {
    "name": "Love Your Neighbour Club",
    "description": "Love Your Neighbour club is a volunteer club with an international network of branches. We are dedicated to serving both the communities we live in as well as globally.",
    "logo": "https://go.sfss.ca/clubs/32/logo"
  },
  {
    "name": "Malaysia Singapore Students Club",
    "description": "To provide a social club for Malaysian and Singapore students and those interested in the related cultures of these countries.",
    "logo": "https://go.sfss.ca/clubs/122/logo"
  },
  {
    "name": "Management Information Systems Association",
    "description": "MISA (Management Information Systems Association) promotes the Faculty of Business Administration concentration of Management Information Systems on campus to inform students of career paths in MIS.",
    "logo": "https://go.sfss.ca/clubs/102/logo"
  },
  {
    "name": "Model United Nations - SFU",
    "description": "Model United Nation will explore different forums within the United Nations and will aim to teach members how MUN works while enhancing their understanding of politics and adding new skills such as quick problem solving and public speaking.",
    "logo": "https://go.sfss.ca/clubs/93/logo"
  },
  {
    "name": "Music Discussion Club",
    "description": "We aim to to provide a welcoming space for discussion of music. Discussion will first and foremost be fun & informative. Everyone stands to learn something new from others with different tastes and lived experiences. This is not a club where you have to know the ins and outs of music theory, but you are welcome to share any knowledge you do have!",
    "logo": "https://go.sfss.ca/clubs/861/logo"
  },
  {
    "name": "Muslim Students Association",
    "description": "To provide prayer facilities, religious information and services, and to foster social connections for all Muslim students on campus.\nAlso to provide awareness and education of Islam for the greater community |\nFacebook: facebook.com/sfumsa/ |\nTwitter: @SFU_MSA | IG: SFU_MSA",
    "logo": "https://go.sfss.ca/clubs/45/logo"
  },
  {
    "name": "NeuraXtension",
    "description": "NeuraXtension targets SFU students keen on learning more about neurotechnology in its everyday use in laboratory and medical settings, day-to-day life, and the business-tech field. The club aims to provide resources, workshops/seminars, networking opportunities, and more!",
    "logo": "https://go.sfss.ca/clubs/919/logo"
  },
  {
    "name": "Nritya Shakti",
    "description": "We plan to include SFU students who practice any of the 8 indian classical dance forms: Bharatanatyam, Kathak, Kuchipudi, Odissi, Kathakali, Sattriya, Manipuri and Mohiniyattam.",
    "logo": "https://go.sfss.ca/clubs/935/logo"
  },
  {
    "name": "Operation Smile SFU",
    "description": "The vision of the Operation Smile SFU club is to work towards a world where no child suffers from a lack of access to safe oral and maxillofacial surgery. All SFU students who are passionate about helping others and interested in medicine or dentistry are welcome!",
    "logo": "https://go.sfss.ca/clubs/920/logo"
  },
  {
    "name": "Outdoors Club - SFU",
    "description": "To support and encourage exploration of the great outdoors by students at SFU.",
    "logo": "https://go.sfss.ca/clubs/38/logo"
  },
  {
    "name": "Pakistan Students Association",
    "description": "To promote Pakistani culture, cuisine and way of life; and to promote multi-culturalism at SFU.",
    "logo": "https://go.sfss.ca/clubs/263/logo"
  },
  {
    "name": "PennyDrops at SFU",
    "description": "PennyDrops is a student-run non-profit organization that champions financial literacy among Canadian youth. The PennyDrops at SFU Chapter aims to engage the SFU community in being a part of the financial literacy movement in Canada.",
    "logo": "https://go.sfss.ca/clubs/869/logo"
  },
  {
    "name": "Phi Delta Epsilon",
    "description": "As a co-ed fraternity, we aim to dispel the competitive stereotypes associated with pre-med students and foster lifelong friendships between women and men pursuing a career in medicine. Through our philanthropy, leadership opportunities, and academic excellence, we hope to instill in our members the skills necessary to excel in the medical field.",
    "logo": "https://go.sfss.ca/clubs/24/logo"
  },
  {
    "name": "Power to Change (P2C)",
    "description": "To help students discover Jesus. We want to add spiritual value to students' lives during their time in university by providing them with opportunities to explore spiritual things through meaningful conversations in the context of discussion groups, meetings and special events.",
    "logo": "https://go.sfss.ca/clubs/170/logo"
  },
  {
    "name": "Pre-Law Society - SFU",
    "description": "The SFU Pre-Law Society is intended for all students who plan on pursuing a future career or education in law. The Pre-Law Society aims to connect students involved in the law school admission process through hosting meetings, events and information sessions.",
    "logo": "https://go.sfss.ca/clubs/491/logo"
  },
  {
    "name": "Pre-Med Society - SFU",
    "description": "The SFU Pre-Med Society is a group of students interested in entering the field of medicine. Info on admissions, med school options, and the MCAT plus interview prep, volunteering, hearing from current med students, and networking with other pre-meds. Join us! SFU clubs/students/external organizations, please contact: premedsfu@gmail.com",
    "logo": "https://go.sfss.ca/clubs/22/logo"
  },
  {
    "name": "Pre-Vet & Animal Wellness Club",
    "description": "The SFU Pre-Vet & Animal Wellness Club aims to connect animal lovers and those considering a career in vet medicine. We provide a place where students can discuss topics related to the career, attend vet/animal-related events, and share their experiences in the veterinary world. This will better prepare students for vet school and the job itself.",
    "logo": "https://go.sfss.ca/clubs/299/logo"
  },
  {
    "name": "Punjabi Student Association - SFU",
    "description": "The Simon Fraser University Punjabi Student Association was established by SFU students in 1996. The PSA has created an avenue for students at SFU to discover and celebrate the richness of  Punjabi culture along with allowing students to make positive contributions in the community.",
    "logo": "https://go.sfss.ca/clubs/111/logo"
  },
  {
    "name": "Pursuit of Happiness",
    "description": "Pursuit of Happiness aims to promote the importance of mental and physical health, and nurture a safe and supportive network for students. We address the challenges of overall wellness experienced by the members of our community through engaging events.",
    "logo": "https://go.sfss.ca/clubs/665/logo"
  },
  {
    "name": "Rock Music Club",
    "description": "The Rock Music Club is here to bring SFU students who are passionate about rock music together. If you are a musicians, vocalists, or fan of any subgenre, then this club is for you.",
    "logo": "https://go.sfss.ca/clubs/930/logo"
  },
  {
    "name": "Satellite Design Club",
    "description": "To discuss, design, plan, and build artificial satellites and their mission profiles.",
    "logo": "https://go.sfss.ca/clubs/644/logo"
  },
  {
    "name": "Science Fiction and Fantasy Bookclub",
    "description": "To encourage students to enjoy reading beyond their assigned texts.  SFF today is a diverse genre, and we hope to introduce more students to it and to foster understanding and enjoyment through discussion.",
    "logo": "https://go.sfss.ca/clubs/885/logo"
  },
  {
    "name": "Science Undergraduate Research Journal (SURJ)",
    "description": "SFU SURJ looks to promote undergraduate research by providing young scientists exposure and recognition for their work while undergoing a peer review process. Ultimately, we hope to foster a community of undergraduates who value research while engaging all student as in science communication and education.",
    "logo": "https://go.sfss.ca/clubs/809/logo"
  },
  {
    "name": "SFU Artists",
    "description": "A club for artists of any kind to connect and collaborate.",
    "logo": "https://go.sfss.ca/clubs/708/logo"
  },
  {
    "name": "SFU ASL Club",
    "description": "An opportunity for those interested, learning or fluent in American Sign Language to practice and socialize.\nThrough movies, videos, and events, we learn about Deaf culture and the Deaf community. We also provide resources and information for those looking to learn ASL or improve their current skills.",
    "logo": "https://go.sfss.ca/clubs/652/logo"
  },
  {
    "name": "SFU Blood, Organ, and Stem Cell Club",
    "description": "SFU Blood, Organ, and Stem Cell Club aims to raise awareness about the need for blood, organ and stem cell donors while providing students/members of the SFU community the opportunity to join this cause.",
    "logo": "https://go.sfss.ca/clubs/677/logo"
  },
  {
    "name": "SFU Calisthenics Club",
    "description": "The club aims to attract individuals interested in bodyweight exercises and learning skills like handstands, handstand push-ups, front levers, and planches. It welcomes those passionate about calisthenics, offering a supportive community for skill development and shared enthusiasm for the sport",
    "logo": "https://go.sfss.ca/clubs/934/logo"
  },
  {
    "name": "SFU Circus Club",
    "description": "Runaway and join the circus... right here at SFU! Learn juggling and a variety of other forms of object manipulation like plate spinning, flower sticks, and contact juggling. Train with and learn from your fellow students in a casual, relaxing environment. Open to all levels of experience from complete beginners to experienced circus artists.",
    "logo": "https://go.sfss.ca/clubs/903/logo"
  },
  {
    "name": "SFU Comics & Graphic Novels Club (SFU CGNC)",
    "description": "A club for anyone interested in comics and graphic novels as a storytelling medium! We’re super welcoming to all levels of comics enthusiasts, from seasoned fans to complete newcomers. This is an opportunity to open up to new stories and perspectives, develop critical thinking skills, and become part of a passionate community of friends.",
    "logo": "https://go.sfss.ca/clubs/897/logo"
  },
  {
    "name": "SFU Competitive Programming",
    "description": "We exist for the purpose of providing an environment for practicing, learning, and enjoying competitive programming. We are trying to build up a team and be competitive in the Northwest region of North America.\nTo join our practices and compete with us, or to just hang out and discuss programming, join our Discord!",
    "logo": "https://go.sfss.ca/clubs/857/logo"
  },
  {
    "name": "SFU Conservatives",
    "description": "The SFU Conservatives' mandate is to provide opportunities for students to participate in the political-democratic process through involvement in the Conservative Party of Canada and its campaigns and local electoral district associations.",
    "logo": "https://go.sfss.ca/clubs/627/logo"
  },
  {
    "name": "SFU Creative Writing Club",
    "description": "SFU Creative Writing facilitates the collection, creation, and publication of creative writing by SFU students. It provides a space for people to share literary works that are meaningful to them. Members exchange published and original works, discuss them, and help provide feedback on request. Please join our discord to join our club activities",
    "logo": "https://go.sfss.ca/clubs/850/logo"
  },
  {
    "name": "SFU Cybersecurity Club",
    "description": "SFU Cybersecurity Club aims to foster a supportive community for students to explore and advance their knowledge in cybersecurity through workshops, CTF competitions, collaborative projects, while promoting ethical practices and enhancing real-world skills. [Discord: https://discord.gg/dN6vh8qV]",
    "logo": "https://go.sfss.ca/clubs/932/logo"
  },
  {
    "name": "SFU Cycling",
    "description": "The target audiences of the club are ALL SFU students that want to venture into the physical activity of road cycling. Rides will take place on paved and designated cycling pathways, and helmets are mandatory.",
    "logo": "https://go.sfss.ca/clubs/916/logo"
  },
  {
    "name": "SFU Dragon Boat",
    "description": "To promote and build a welcoming, inclusive, and supportive community around the sport of dragon boat paddling at SFU. Additionally, SFU Dragon Boat facilitates the creation and support of the day to day operation of SFU dragon boat teams.",
    "logo": "https://go.sfss.ca/clubs/676/logo"
  },
  {
    "name": "SFU Esports Association",
    "description": "To serve as a unifying brand for various student led gaming communities across the region",
    "logo": "https://go.sfss.ca/clubs/709/logo"
  },
  {
    "name": "SFU First Responders",
    "description": "To provide those with an interest in first aid, regardless of skill level or experience, with the opportunity to learn new skills, maintain current ones, and meet others with similar interests. To become a member simply join our discord https://discord.gg/gqSb7bDvJz (Joining on gosfss doesn’t add you automatically to our contact list)",
    "logo": "https://go.sfss.ca/clubs/763/logo"
  },
  {
    "name": "SFU Foodie Club",
    "description": "A must join for all SFU Students! Our club provides a fun, welcoming, and inclusive community where SFU students can explore a wide range of super fun activities, discover new interests, and explore new cuisines together. We want our foodies to have fun, enjoy good food, and make meaningful connections along the way.",
    "logo": "https://go.sfss.ca/clubs/891/logo"
  },
  {
    "name": "SFU Golf Club",
    "description": "To provide a community for golf enthusiasts to learn, grow, and connect with players of all skill levels while making golf enjoyable. Instagram @ sfugolfclub",
    "logo": "https://go.sfss.ca/clubs/906/logo"
  },
  {
    "name": "SFU Hanfu Culture Society",
    "description": "SFU Hanfu club aims to promoting and protecting Chinese traditional culture. We sincerely offer you the membership of Hanfu club. With this membership, you can enjoy a 15% off on all workshops held by our society at SFU and UBC.",
    "logo": "https://go.sfss.ca/clubs/637/logo"
  },
  {
    "name": "SFU Heart and Stroke Foundation (SFUHSF)",
    "description": "Individuals with the desire to raise awareness about heart and stroke conditions including but not limited to: people who have been impacted by these conditions, people who wish to contribute to funding treatment related to these condition and people who wish to learn more about the conditions.",
    "logo": "https://go.sfss.ca/clubs/908/logo"
  },
  {
    "name": "SFU Hindu Yuva",
    "description": "We plan to target all SFU students as well as professors and staff who are interested in learning more about the hindu culture.",
    "logo": "https://go.sfss.ca/clubs/911/logo"
  },
  {
    "name": "SFU Knitting Club",
    "description": "The purpose of SFU Knitting Club is to facilitate healthy stress-reduction techniques to improve student well-being. This club will teach students valuable skills so they can create something they are proud of.\nStay connected by following SFU Knitting Club on Instagram and Facebook!",
    "logo": "https://go.sfss.ca/clubs/807/logo"
  },
  {
    "name": "SFU Lung Health Initiative",
    "description": "SFU Lung Health Initiative (LHI) introduces students to unique and common topics in lung health, participates in fundraising initiatives for pulmonary health research, and highlights careers with a focus in pulmonology. We also work to foster a community for students interested in lung health by hosting social events.",
    "logo": "https://go.sfss.ca/clubs/918/logo"
  },
  {
    "name": "SFU LYFE",
    "description": "SFU LYFE is a personal and professional development platform that hosts social and career development events as we emphasize having a work-life balance. We also run various projects, such as our blog and podcast, so be sure to check out our Instagram @sfulyfeclub",
    "logo": "https://go.sfss.ca/clubs/811/logo"
  },
  {
    "name": "SFU Magic the Gathering Club (MTG)",
    "description": "The SFU MTG Club is designed to support those who enjoy playing Magic the gathering or who want to give it a try. We aim to create an environment that is both safe and inviting for everyone to have fun and meet new people who share their interests!",
    "logo": "https://go.sfss.ca/clubs/433/logo"
  },
  {
    "name": "SFU Mechanical Keyboards Club",
    "description": "To introduce students to the joy of mechanical keyboards and hosting meet ups to share and show off custom boards.",
    "logo": "https://go.sfss.ca/clubs/837/logo"
  },
  {
    "name": "SFU New Democratic Party",
    "description": "The SFU NDP's primary focus is to engage and empower young students between the ages of 18 and 30. We aim to ensure youth on the SFU Campus are involved in the political discourse. However, it is important to note the SFU NDP is an inclusive organization, welcoming students of all ages and from diverse academic backgrounds. We operate on the SFU Burnaby, SFU Vancouver, and SFU Surrey campuses. We represent both the Federal NDP Party and BC NDP Party. ( updated June 24th, 2024.)",
    "logo": "https://go.sfss.ca/clubs/924/logo"
  },
  {
    "name": "SFU OS Development",
    "description": "We bring together students from different backgrounds to collaborate on projects that positively impact our community. Members gain practical experience to build project portfolios with guidance from the Open Source Community.\nJoin our discord here: https://discord.gg/8CSRTyPXJ4",
    "logo": "https://go.sfss.ca/clubs/867/logo"
  },
  {
    "name": "SFU Peak Frequency",
    "description": "To provide performance opportunities for student musicians and foster a musical environment where people can socialize and share a common interest.",
    "logo": "https://go.sfss.ca/clubs/120/logo"
  },
  {
    "name": "SFU Pokemon Go Official Group",
    "description": "Official campus trade/pvp/raid group! Doesn't matter what team you are on, come meet other players in the SFU community!",
    "logo": "https://go.sfss.ca/clubs/817/logo"
  },
  {
    "name": "SFU Polyglots",
    "description": "SFU Polyglots aims to provide a casual and friendly environment for students to meet and discuss all things related to languages, including language acquisition, and language exchange, with fellow members of the SFU community.",
    "logo": "https://go.sfss.ca/clubs/868/logo"
  },
  {
    "name": "SFU Real Estate Club",
    "description": "The SFU Real Estate Club is a student led organization that allows students to be exposed to the real estate world through events and projects. Our vision is to create a community amongst the students interested in real estate and help them grow their network within the industry.",
    "logo": "https://go.sfss.ca/clubs/846/logo"
  },
  {
    "name": "SFU Robot Soccer",
    "description": "SFU Robot Soccer club aims to combine the excitement of soccer with the future of automated technology as we compete in RoboCup. Our team encourages students from all programs to learn concepts that are not taught in class and get hands-on experience with robotics, artificial intelligence, and teamwork.\nJoin our Discord via: linktr.ee/sfurs",
    "logo": "https://go.sfss.ca/clubs/721/logo"
  },
  {
    "name": "SFU Robotics Club",
    "description": "SFU students that are interested in learning about robotics and/or participating in robotics related activities (ex. competitions)",
    "logo": "https://go.sfss.ca/clubs/917/logo"
  },
  {
    "name": "SFU Sports Analytics Club",
    "description": "Where data and sports come together. We aim to connect individuals interested in sports, data, or analysis to share ideas and opinions. As data is more prevalent and publicly available than ever, we promote the importance of usage of data to investigate sports-related issues in the light of improving performance and strategies.",
    "logo": "https://go.sfss.ca/clubs/620/logo"
  },
  {
    "name": "SFU Surge",
    "description": "We are a community for students in tech to learn from industry professionals at conferences and talks, to hone skills and experience at large-scale hackathons and competitions, to network at events and workshops to enable community innovation, and to gain project experience working on software used by SFU students.",
    "logo": "https://go.sfss.ca/clubs/831/logo",
    "email": "sfusurge@gmail.com",
    "website": "https://sfusurge.com/"
  },
  {
    "name": "SFU Swifties",
    "description": "A club for fans of music to talk about anything and everything with a shared interest in Taylor Swift's music and projects :)\nFor timely updates and announcements, please follow our instagram page or Discord server (located on the linktree website)",
    "logo": "https://go.sfss.ca/clubs/880/logo"
  },
  {
    "name": "SFU Thaqalyn Muslim Association",
    "description": "As a collective, TMA SFU aims to embody and promote the values of the Quran, the Holy Prophet PBUH and his holy Household within our society and on campus, as we prepare for the reappearance of the Imam of our time. In addition, we hope to provide an inclusive, supportive and accepting environment for Muslim students at Simon Fraser University.",
    "logo": "https://go.sfss.ca/clubs/900/logo"
  },
  {
    "name": "SFU Transit Enthusiasts Club (SFU TEC)",
    "description": "Welcome to the SFU Transit Enthusiasts Club (SFU TEC)! Join us for discussions about Public Transit in Metro Vancouver and the world, whether you already know or you want to learn more! We have a very active discord server, but we also meet in-person once a month, either a social or an outing to a transit-related event or attraction.",
    "logo": "https://go.sfss.ca/clubs/898/logo"
  },
  {
    "name": "Sikh Students' Association - SFU",
    "description": "Establish a strong network for those who are exploring the Sikh way of life. We hope to achieve this by promoting Sikh values such as equality, peace and truthful living in order to create a strong and united Sikh community at Simon Fraser University.",
    "logo": "https://go.sfss.ca/clubs/147/logo"
  },
  {
    "name": "Simon Fraser Investment Club",
    "description": "The Simon Fraser Investment Club prepares students for careers in financial services and investing in public and private markets.",
    "logo": "https://go.sfss.ca/clubs/29/logo"
  },
  {
    "name": "Ski and Snowboard Club",
    "description": "The Ski and Snowboard club is focused on bringing together the SFU shred community, regardless of abilities on the slopes! We're just a group of RAD people looking for more RAD people to be RAD with! If you're looking for good times, and to make some turns on the slopes this season, this club is for you!",
    "logo": "https://go.sfss.ca/clubs/629/logo"
  },
  {
    "name": "Smash Club",
    "description": "To provide a place for students to play the popular video game franchise Super Smash Bros., both competitively and casually.",
    "logo": "https://go.sfss.ca/clubs/517/logo"
  },
  {
    "name": "STEM Fellowship",
    "description": "Non-profit organization at SFU that strives to engage future leaders and innovators in science, technology, engineering, and mathematics.",
    "logo": "https://go.sfss.ca/clubs/839/logo"
  },
  {
    "name": "Student Marketing Association",
    "description": "The Student Marketing Association (SMA) is SFU’s creative and innovative marketing-based student club. Students from all faculties join together in this organization to gain skills in marketing, event coordination, and leadership, planning numerous social and professional events throughout the year.\nInstagram: https://www.instagram.com/sfusma/\nLinkedin: https://www.linkedin.com/company/sfu-student-marketing-association\nFacebook: https://www.facebook.com/SFUStudentMarketingAssociation",
    "logo": "https://go.sfss.ca/clubs/207/logo"
  },
  {
    "name": "Tabletop",
    "description": "Tabletop is a club dedicated to building a safe, accessible, and welcoming community where students can play board games, roleplaying games, and many other tabletop games together.",
    "logo": "https://go.sfss.ca/clubs/899/logo"
  },
  {
    "name": "Taiwanese Association - SFU",
    "description": "SFUTA was established in 1989, We are the bridge between Canada and Taiwan. We are a social and cultural club that promotes an engaging university experience. SFUTA成立於1989年，我們是加拿大和台灣之間的橋樑。我們是一個多元文化社團，旨在促進學生參與大學的生活體驗。",
    "logo": "https://go.sfss.ca/clubs/148/logo"
  },
  {
    "name": "Tamil Student Association  (TSA)",
    "description": "To be a safe space where students affiliated with the Tamil language, culture and heritage, can come together to provide opportunities to bring both Tamils and non-Tamils together.",
    "logo": "https://go.sfss.ca/clubs/842/logo"
  },
  {
    "name": "Team Phantom: SFU Formula SAE Electric",
    "description": "The goal of this club is to compete in the Formula SAE Electric Competition. The club will do this by designing and creating a fully electric vehicle using engineering principles.",
    "logo": "https://go.sfss.ca/clubs/675/logo"
  },
  {
    "name": "The Point",
    "description": "A club on campus whose goal is to Love God, Love People, Serve All, by hosting events open to those part of The Point Church and to those who are not.  Through worship and service, we aim to foster a positive atmosphere on campus where students can explore what it means to follow Jesus.",
    "logo": "https://go.sfss.ca/clubs/94/logo"
  },
  {
    "name": "Thé SFU Tea",
    "description": "We aim to encourage and maintain the appreciation of tea in all forms.",
    "logo": "https://go.sfss.ca/clubs/168/logo"
  },
  {
    "name": "Turkic Student Union",
    "description": "The SFU Turkic Student Union aims to promote cultural exchange within the SFU community. Through events, workshops, and collaborations, we strive to create an inclusive space for learning, networking, and embracing the rich diversity of Turkic heritage.",
    "logo": "https://go.sfss.ca/clubs/936/logo"
  },
  {
    "name": "Ukrainian Student Society",
    "description": "Ukrainian Student Society wants to celebrate Ukrainian identity, culture, and language. We also want to bring awareness about russian aggression and aid Ukraine to help to win the battle for liberty and freedom.",
    "logo": "https://go.sfss.ca/clubs/913/logo"
  },
  {
    "name": "UNICEF - SFU",
    "description": "Our focus is to advocate, educate, and fundraise to join the global effort of reversing child-focused humanitarian issues in the developing world.",
    "logo": "https://go.sfss.ca/clubs/166/logo"
  },
  {
    "name": "University Bible Fellowship",
    "description": "To help students study the Bible and live according to its teachings.",
    "logo": "https://go.sfss.ca/clubs/15/logo"
  },
  {
    "name": "University Christian Ministries",
    "description": "UCM SFU is a Christian community of students at Simon Fraser University. We exist to know and love God, love one another, care for all of our campuses, and tell others about Jesus.",
    "logo": "https://go.sfss.ca/clubs/92/logo"
  },
  {
    "name": "UPhoto Photography Club",
    "description": "Everyone who is interested in photography is welcome to join UPhoto. You don't have to be a professional photographer or own a fancy camera to participate in our events. Our goal is simple: to provide to those who are interested in photography with a welcoming platform, to have fun and to learn skills from others!",
    "logo": "https://go.sfss.ca/clubs/211/logo"
  },
  {
    "name": "Vietnamese Student Association",
    "description": "An official group for all Vietnamese students and all those who are interested in Vietnamese culture at Simon Fraser University.",
    "logo": "https://go.sfss.ca/clubs/89/logo"
  },
  {
    "name": "Vocal Jazz- SFU",
    "description": "To spread musical joy throughout the SFU campus.",
    "logo": "https://go.sfss.ca/clubs/192/logo"
  },
  {
    "name": "Women in Clean Tech",
    "description": "Women in Clean Tech (WiCT) is an all-inclusive club aiming to connect students in STEM, as well as facilitate clean tech initiatives and projects for our club members. Follow @wict_sfu on Instagram for all updates!\nWhile the focus of this club is to connect and support the women student body interested in this field, all are welcome to join.",
    "logo": "https://go.sfss.ca/clubs/833/logo"
  },
  {
    "name": "Women In Engineering",
    "description": "Women in Engineering club stands for diversity, inclusion, and representation of minorities in engineering. We are a club that aims to empower women in STEM through events with a focus toward outreach, support, and career development.",
    "logo": "https://go.sfss.ca/clubs/255/logo"
  },
  {
    "name": "Women in STEM",
    "description": "Women in STEM (WiSTEM) is allied with all students of different backgrounds and identities to create a supportive environment in all fields of STEM. Our main focus is to connect with women through various outreach and networking environments (e.g., study sessions, panels, mixers). This club is open to everyone to join.",
    "logo": "https://go.sfss.ca/clubs/634/logo"
  },
  {
    "name": "Young Women in Business SFU",
    "description": "YWiB SFU strives to engage leaders from all faculties through opportunities for personal and professional growth. We encourage members to achieve success on their own terms through our programs that focus on mentorship, networking, philanthropy and tangible skill building.\nTo join YWiB please apply via our website:\nwww.ywib.ca/sfu/programs",
    "logo": "https://go.sfss.ca/clubs/146/logo"
  }
]